# Задание 5
p = float(input("Введите число p: "))  # Пользователь вводит число p
result = p + p*2 + p3 + p4 + p*5
print(result)