
# Задание 7
pi_value = int(input("Введите значение переменной pi_value: "))  # Пользователь вводит значение переменной pi_value
if pi_value % 2 == 0:
    print("Число в переменной pi_value четное")
else:
    print("Число в переменной pi_value нечетное")